benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_NVIDIA_Nemotron_3_Nano_30B_A3B_FP8_text_only_20260130_015912.txt
##############################################################
# vLLM TEXT-ONLY BENCHMARK RESULTS
##############################################################

DEVICE INFO
-----------
Device (raw):       NVIDIA GB10
Device (sanitized): NVIDIA_GB10
NVIDIA GB10, [N/A], 580.95.05, 12.1

METADATA
--------
Date:            Fri Jan 30 01:59:12 AM UTC 2026
Hostname:        spark-ff62
Model:           nvidia/NVIDIA-Nemotron-3-Nano-30B-A3B-FP8
Test Type:       Text-Only
Thinking Mode:   DISABLED
Num Prompts:     100
Max Concurrency: 10
Num Warmups:     10
Input Length:    1000 (±0.3)
Output Length:   300 (±0.3)
Seed:            42

##############################################################
# TEST RESULTS
##############################################################

============================================================
TEST: Text-Only Benchmark
Started: Fri Jan 30 01:59:12 AM UTC 2026
Note: Thinking mode DISABLED for this model
============================================================

Script started on 2026-01-30 01:59:12+00:00 [COMMAND="bash /tmp/tmp.ZaCneT3xSo" TERM="xterm-256color" TTY="/dev/pts/13" COLUMNS="194" LINES="24"]

==========
== vLLM ==
==========

NVIDIA Release 25.12.post1 (build 247811356)
vLLM Version 0.12.0+35a9f223
Container image Copyright (c) 2025, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

Various files include modifications (c) NVIDIA CORPORATION & AFFILIATES.  All rights reserved.

GOVERNING TERMS: The software and materials are governed by the NVIDIA Software License Agreement
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/nvidia-software-license-agreement/)
and the Product-Specific Terms for NVIDIA AI Products
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/product-specific-terms-for-ai-products/).

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

NOTE: The SHMEM allocation limit is set to the default of 64MB.  This may be
   insufficient for vLLM.  NVIDIA recommends the use of the following flags:
   docker run --gpus all --ipc=host --ulimit memlock=-1 --ulimit stack=67108864 ...

/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
INFO 01-30 01:59:14 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 01-30 01:59:14 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 01-30 01:59:14 [interface.py:221] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 01-30 01:59:15 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xeaebcd418e00>, seed=42, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=300, random_range_ratio=0.3, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=10, model='nvidia/NVIDIA-Nemotron-3-Nano-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=10, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9e993830-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body={'chat_template_kwargs': {'enable_thinking': False}})
tokenizer_config.json: 0.00B [00:00, ?B/s]tokenizer_config.json: 188kB [00:00, 423MB/s]
tokenizer.json:   0%|                                                                                                                                                 | 0.00/17.1M [00:00<?, ?B/s]tokenizer.json:   0%|▌                                                                                                                                       | 77.4k/17.1M [00:01<05:49, 48.6kB/s]tokenizer.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 17.1M/17.1M [00:01<00:00, 10.7MB/s]
special_tokens_map.json:   0%|                                                                                                                                          | 0.00/420 [00:00<?, ?B/s]special_tokens_map.json: 100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 420/420 [00:00<00:00, 11.4MB/s]
chat_template.jinja: 0.00B [00:00, ?B/s]chat_template.jinja: 10.5kB [00:00, 84.7MB/s]
INFO 01-30 01:59:20 [datasets.py:613] Sampling input_len from [700, 1300] and output_len from [210, 390]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |                                                                                                                                                                    | 00:00 elapsed, ? remaining |                                                                                                                                                                | 00:00 elapsed, 00:09 remaining |                                                                                                                                                          | 00:29 elapsed, 10888:26:28 remaining
Initial test run completed.
Warming up with 10 requests...
  0%|                                                                                                                                                                      | 0/10 [00:00<?, ?it/s] 10%|███████████████▊                                                                                                                                              | 1/10 [00:29<04:28, 29.82s/it] 70%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████▌                                               | 7/10 [00:29<00:09,  3.13s/it]100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 10/10 [00:29<00:00,  3.00s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
  0%|                                                                                                                                                                     | 0/100 [00:00<?, ?it/s]  1%|█▌                                                                                                                                                           | 1/100 [00:15<25:44, 15.60s/it]  2%|███▏                                                                                                                                                         | 2/100 [00:17<12:44,  7.80s/it]  3%|████▋                                                                                                                                                        | 3/100 [00:21<09:25,  5.83s/it]  4%|██████▎                                                                                                                                                      | 4/100 [00:23<07:11,  4.49s/it]  5%|███████▊                                                                                                                                                     | 5/100 [00:24<05:00,  3.17s/it]  6%|█████████▍                                                                                                                                                   | 6/100 [00:25<03:51,  2.46s/it]  9%|██████████████▏                                                                                                                                              | 9/100 [00:26<01:39,  1.09s/it] 10%|███████████████▌                                                                                                                                            | 10/100 [00:27<01:39,  1.10s/it] 11%|█████████████████▏                                                                                                                                          | 11/100 [00:34<03:41,  2.49s/it] 12%|██████████████████▋                                                                                                                                         | 12/100 [00:39<04:51,  3.31s/it] 13%|████████████████████▎                                                                                                                                       | 13/100 [00:41<04:02,  2.79s/it] 14%|█████████████████████▊                                                                                                                                      | 14/100 [00:41<03:03,  2.13s/it] 15%|███████████████████████▍                                                                                                                                    | 15/100 [00:42<02:26,  1.73s/it] 16%|████████████████████████▉                                                                                                                                   | 16/100 [00:43<02:07,  1.52s/it] 18%|████████████████████████████                                                                                                                                | 18/100 [00:45<01:40,  1.22s/it] 19%|█████████████████████████████▋                                                                                                                              | 19/100 [00:46<01:39,  1.23s/it] 20%|███████████████████████████████▏                                                                                                                            | 20/100 [00:48<01:47,  1.34s/it] 21%|████████████████████████████████▊                                                                                                                           | 21/100 [00:53<03:16,  2.48s/it] 22%|██████████████████████████████████▎                                                                                                                         | 22/100 [00:57<03:46,  2.90s/it] 23%|███████████████████████████████████▉                                                                                                                        | 23/100 [01:00<03:45,  2.93s/it] 24%|█████████████████████████████████████▍                                                                                                                      | 24/100 [01:01<03:01,  2.38s/it] 25%|███████████████████████████████████████                                                                                                                     | 25/100 [01:02<02:34,  2.06s/it] 26%|████████████████████████████████████████▌                                                                                                                   | 26/100 [01:03<01:59,  1.61s/it] 27%|██████████████████████████████████████████                                                                                                                  | 27/100 [01:05<02:16,  1.87s/it] 28%|███████████████████████████████████████████▋                                                                                                                | 28/100 [01:06<01:48,  1.51s/it] 29%|█████████████████████████████████████████████▏                                                                                                              | 29/100 [01:07<01:39,  1.41s/it] 30%|██████████████████████████████████████████████▊                                                                                                             | 30/100 [01:09<01:34,  1.36s/it] 31%|████████████████████████████████████████████████▎                                                                                                           | 31/100 [01:14<02:55,  2.55s/it] 32%|█████████████████████████████████████████████████▉                                                                                                          | 32/100 [01:17<02:54,  2.57s/it] 33%|███████████████████████████████████████████████████▍                                                                                                        | 33/100 [01:19<02:44,  2.45s/it] 34%|█████████████████████████████████████████████████████                                                                                                       | 34/100 [01:21<02:37,  2.38s/it] 35%|██████████████████████████████████████████████████████▌                                                                                                     | 35/100 [01:22<02:04,  1.91s/it] 36%|████████████████████████████████████████████████████████▏                                                                                                   | 36/100 [01:24<02:01,  1.89s/it] 37%|█████████████████████████████████████████████████████████▋                                                                                                  | 37/100 [01:26<02:08,  2.05s/it] 38%|███████████████████████████████████████████████████████████▎                                                                                                | 38/100 [01:28<02:01,  1.96s/it] 39%|████████████████████████████████████████████████████████████▊                                                                                               | 39/100 [01:28<01:35,  1.57s/it] 40%|██████████████████████████████████████████████████████████████▍                                                                                             | 40/100 [01:29<01:14,  1.25s/it] 41%|███████████████████████████████████████████████████████████████▉                                                                                            | 41/100 [01:34<02:25,  2.46s/it] 42%|█████████████████████████████████████████████████████████████████▌                                                                                          | 42/100 [01:37<02:26,  2.53s/it] 43%|███████████████████████████████████████████████████████████████████                                                                                         | 43/100 [01:41<02:56,  3.09s/it] 45%|██████████████████████████████████████████████████████████████████████▏                                                                                     | 45/100 [01:42<01:41,  1.84s/it] 46%|███████████████████████████████████████████████████████████████████████▊                                                                                    | 46/100 [01:44<01:45,  1.96s/it] 47%|█████████████████████████████████████████████████████████████████████████▎                                                                                  | 47/100 [01:46<01:38,  1.86s/it] 48%|██████████████████████████████████████████████████████████████████████████▉                                                                                 | 48/100 [01:49<01:56,  2.24s/it] 50%|██████████████████████████████████████████████████████████████████████████████                                                                              | 50/100 [01:53<01:46,  2.12s/it] 51%|███████████████████████████████████████████████████████████████████████████████▌                                                                            | 51/100 [01:55<01:43,  2.12s/it] 52%|█████████████████████████████████████████████████████████████████████████████████                                                                           | 52/100 [01:59<02:01,  2.52s/it] 54%|████████████████████████████████████████████████████████████████████████████████████▏                                                                       | 54/100 [02:01<01:28,  1.93s/it] 55%|█████████████████████████████████████████████████████████████████████████████████████▊                                                                      | 55/100 [02:02<01:12,  1.62s/it] 56%|███████████████████████████████████████████████████████████████████████████████████████▎                                                                    | 56/100 [02:06<01:42,  2.32s/it] 57%|████████████████████████████████████████████████████████████████████████████████████████▉                                                                   | 57/100 [02:07<01:22,  1.91s/it] 58%|██████████████████████████████████████████████████████████████████████████████████████████▍                                                                 | 58/100 [02:10<01:29,  2.13s/it] 59%|████████████████████████████████████████████████████████████████████████████████████████████                                                                | 59/100 [02:10<01:11,  1.74s/it] 60%|█████████████████████████████████████████████████████████████████████████████████████████████▌                                                              | 60/100 [02:16<01:52,  2.81s/it] 61%|███████████████████████████████████████████████████████████████████████████████████████████████▏                                                            | 61/100 [02:18<01:36,  2.46s/it] 62%|████████████████████████████████████████████████████████████████████████████████████████████████▋                                                           | 62/100 [02:19<01:25,  2.25s/it] 63%|██████████████████████████████████████████████████████████████████████████████████████████████████▎                                                         | 63/100 [02:20<01:05,  1.77s/it] 64%|███████████████████████████████████████████████████████████████████████████████████████████████████▊                                                        | 64/100 [02:21<00:57,  1.59s/it] 66%|██████████████████████████████████████████████████████████████████████████████████████████████████████▉                                                     | 66/100 [02:24<00:54,  1.60s/it] 67%|████████████████████████████████████████████████████████████████████████████████████████████████████████▌                                                   | 67/100 [02:25<00:48,  1.46s/it] 68%|██████████████████████████████████████████████████████████████████████████████████████████████████████████                                                  | 68/100 [02:28<00:56,  1.75s/it] 69%|███████████████████████████████████████████████████████████████████████████████████████████████████████████▋                                                | 69/100 [02:30<00:57,  1.85s/it] 70%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                                              | 70/100 [02:31<00:49,  1.66s/it] 71%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████▊                                             | 71/100 [02:34<00:57,  1.98s/it] 72%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████▎                                           | 72/100 [02:36<00:53,  1.90s/it] 73%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉                                          | 73/100 [02:43<01:36,  3.57s/it] 75%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████                                       | 75/100 [02:44<00:53,  2.15s/it] 77%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████                                    | 77/100 [02:45<00:33,  1.47s/it] 78%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋                                  | 78/100 [02:49<00:42,  1.94s/it] 79%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                                | 79/100 [02:51<00:44,  2.12s/it] 81%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▎                             | 81/100 [02:55<00:39,  2.06s/it] 82%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉                            | 82/100 [02:59<00:42,  2.36s/it] 83%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍                          | 83/100 [03:00<00:36,  2.13s/it] 84%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████                         | 84/100 [03:03<00:37,  2.32s/it] 85%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▌                       | 85/100 [03:03<00:27,  1.83s/it] 86%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                     | 86/100 [03:04<00:20,  1.48s/it] 87%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋                    | 87/100 [03:06<00:21,  1.65s/it] 88%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▎                  | 88/100 [03:07<00:16,  1.38s/it] 89%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊                 | 89/100 [03:08<00:14,  1.35s/it] 90%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍               | 90/100 [03:09<00:12,  1.24s/it] 91%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉              | 91/100 [03:16<00:27,  3.03s/it] 92%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▌            | 92/100 [03:18<00:20,  2.55s/it] 93%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████           | 93/100 [03:19<00:14,  2.01s/it] 94%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋         | 94/100 [03:19<00:09,  1.58s/it] 95%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏       | 95/100 [03:19<00:05,  1.15s/it] 96%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊      | 96/100 [03:19<00:03,  1.15it/s] 97%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▎    | 97/100 [03:20<00:02,  1.13it/s] 98%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉   | 98/100 [03:21<00:01,  1.20it/s] 99%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍ | 99/100 [03:22<00:00,  1.10it/s]100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [03:24<00:00,  1.14s/it]100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [03:24<00:00,  2.04s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  204.32    
Total input tokens:                      101603    
Total generated tokens:                  29842     
Request throughput (req/s):              0.49      
Output token throughput (tok/s):         146.06    
Peak output token throughput (tok/s):    230.00    
Peak concurrent requests:                13.00     
Total Token throughput (tok/s):          643.34    
---------------Time to First Token----------------
Mean TTFT (ms):                          610.81    
Median TTFT (ms):                        441.00    
P99 TTFT (ms):                           2470.00   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          65.30     
Median TPOT (ms):                        65.68     
P99 TPOT (ms):                           72.16     
---------------Inter-token Latency----------------
Mean ITL (ms):                           65.06     
Median ITL (ms):                         56.99     
P99 ITL (ms):                            385.92    
==================================================

Script done on 2026-01-30 02:03:45+00:00 [COMMAND_EXIT_CODE="0"]
CSV saved to: ./benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_NVIDIA_Nemotron_3_Nano_30B_A3B_FP8_text_only_samples_100_20260130_015912.csv

Completed: Fri Jan 30 02:03:45 AM UTC 2026


##############################################################
# vLLM TEXT-ONLY BENCHMARK COMPLETE
##############################################################
Results saved to: ./benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_NVIDIA_Nemotron_3_Nano_30B_A3B_FP8_text_only_20260130_015912.txt